In [1]:
from pandas import DataFrame, Series
import pandas as pd
import numpy as np

In [4]:
def extract_city_name(df):
    """
    Chicago, IL -> Chicago for city_name column
    """
    df['city_name'] = df['city_and_code'].str.split(",").str.get(0)
    return df

def add_country_name(df, country_name=None):
    """
    Chicago -> Chicago-US for city_name column
    """
    col = 'city_name'
    df['city_and_country'] = df[col] + country_name
    return df

In [6]:
df_p = pd.DataFrame({'city_and_code': ['Chicago, IL']})
df_p

  city_and_code
0   Chicago, IL

In [7]:
add_country_name(extract_city_name(df_p), country_name='US')

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [9]:
(df_p.pipe(extract_city_name).pipe(add_country_name, country_name="US"))

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [19]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one       two     three
a  0.757384 -2.882168       NaN
b  0.061153  1.594997 -0.946144
c -1.345680 -0.922717 -1.668960
d       NaN  0.965508  0.881599

In [12]:
df.apply(np.mean)

one     -0.741715
two      0.070475
three    0.271290
dtype: float64

In [13]:
df.apply(np.mean, axis=1)

a   -0.346375
b    0.084719
c   -0.097175
d   -0.199628
dtype: float64

In [14]:
df.apply(lambda x: x.max() - x.min())

one      1.181291
two      1.137833
three    1.418321
dtype: float64

In [15]:
df.apply(np.cumsum)

        one       two     three
a -0.217423 -0.475326       NaN
b -0.826430 -0.505917  0.893755
c -2.225145  0.156590  1.338436
d       NaN  0.281901  0.813870

In [20]:
df.apply(np.exp)

        one       two     three
a  2.132689  0.056013       NaN
b  1.063061  4.928315  0.388235
c  0.260363  0.397438  0.188443
d       NaN  2.626122  2.414758

In [26]:
def func(x):
    return x ** 2

In [27]:
df.apply(func)

        one       two     three
a  0.573630  8.306890       NaN
b  0.003740  2.544016  0.895188
c  1.810854  0.851407  2.785427
d       NaN  0.932206  0.777217

In [28]:
def subtract_and_divide(x, sub, divide=1):
    return (x - sub) / divide

In [29]:
df.apply(subtract_and_divide, args=(5,3))

        one       two     three
a -1.414205 -2.627389       NaN
b -1.646282 -1.135001 -1.982048
c -2.115227 -1.974239 -2.222987
d       NaN -1.344831 -1.372800

In [30]:
def subtract(x, sub):
    return (x - sub)

df.apply(subtract, args=(5,))

        one       two     three
a -4.242616 -7.882168       NaN
b -4.938847 -3.405003 -5.946144
c -6.345680 -5.922717 -6.668960
d       NaN -4.034492 -4.118401